import threading
from ssh_honeypot import start_ssh_honeypot
from http_honeypot import start_http_honeypot

print("""
██╗  ██╗ ██████╗ ███╗   ██╗███████╗██╗   ██╗██████╗  ██████╗ ████████╗
██║  ██║██╔═══██╗████╗  ██║██╔════╝╚██╗ ██╔╝██╔══██╗██╔═══██╗╚══██╔══╝
███████║██║   ██║██╔██╗ ██║█████╗   ╚████╔╝ ██████╔╝██║   ██║   ██║   
██╔══██║██║   ██║██║╚██╗██║██╔══╝    ╚██╔╝  ██╔═══╝ ██║   ██║   ██║   
██║  ██║╚██████╔╝██║ ╚████║███████╗   ██║   ██║     ╚██████╔╝   ██║   
╚═╝  ╚═╝ ╚═════╝ ╚═╝  ╚═══╝╚══════╝   ╚═╝   ╚═╝      ╚═════╝    ╚═╝   
""")

print("[*] Starting Honeypot...")
print("[*] SSH Honeypot  -> Port 22")
print("[*] HTTP Honeypot -> Port 80")
print("[*] Logs are saved in the logs/ directory")
print("[*] Press Ctrl+C to stop\n")

ssh_thread = threading.Thread(target=start_ssh_honeypot)
ssh_thread.daemon = True
ssh_thread.start()

http_thread = threading.Thread(target=start_http_honeypot)
http_thread.daemon = True
http_thread.start()

# Keep main thread alive
try:
    while True:
        pass
except KeyboardInterrupt:
    print("\n[!] Honeypot stopped.")
